#include <iostream>
#include "Triangle.h"
using namespace std;

int main() {
	cout << "172054213 - 宋海禹" << endl;
	/******************************************************************/
	//cout << "实验2-1.1：定义三角形类的一个实例（对象）" << endl;
	//Triangle Tri(7, 8, 9);    //定义三角形类的一个实例（对象）  
	//Tri.showMessage();
	/******************************************************************/
	//cout << "实验2-1.2：设计无参构造函数，默认各边长为1" << endl;
	//Triangle Tri;   //调用默认构造函数，不指定参数时，默认各边长为1；  
	//Tri.showMessage();
	/******************************************************************/
	//cout << "使用带默认参数值的构造函数，不给定实参时，默认边长为1" << endl;
	//Triangle Tri1;   //定义边长为1 1 1的三角形类实例  
	//Tri1.showMessage();
	//Triangle Tri2(1.5);//定义边长为1.5 1 1的三角形类实例  
	//Tri2.showMessage();
	//Triangle Tri3(1.5, 1.5);//定义边长为1.5 1.5 1的三角形类实例  
	//Tri3.showMessage();
	//Triangle Tri4(7, 8, 9); //定义边长为7 8 9的三角形类实例  
	//Tri4.showMessage();
	/******************************************************************/
	cout << "在构造函数中使用参数初始化表对数据成员初始化。测试函数同（1）" << endl;
	Triangle Tri(7, 8, 9);    //定义三角形类的一个实例（对象）  
	Tri.showMessage();
	/******************************************************************/
	system("pause");
	return 0;
}